Revit 2024 API
StructuralSection.ElasticModulusStrongAxis Property
 Elastic section modulus about main strong axis for calculation of bending stresses.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double ElasticModulusStrongAxis { get; set; }
Visual Basic
Public Property ElasticModulusStrongAxis As Double
	Get
	Set
Visual C++
public:
property double ElasticModulusStrongAxis {
	double get ();
	void set (double value);
}
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace